# Реализуйте алгоритм перемешивания списка

sizelist = int(input('Введите размер списка: '))
somelist = []
for i in range(sizelist):
    somelist.append(i)
print(somelist)